{
    "blog001": {
        "title": "Let's do the thing!",
        "Date": "December 14, 2018",
        "entry": "I've gone back and forth on how I intend to structure my personal portfolio site, and have finally settled on a blog format for my main content. This will be mostly for my own benefit, as these weekly or bi-weekly check-ins should provide a opportunity for personal reflection as I learn more about software development. <br/><br/> Right now I am wrapping up week 18 (has it already been 18 weeks!!??) of the Part-Time Web Developer Bootcamp at Nashville Software School. The subject material for this week is pretty much what my entire cohort has been waiting for: REACT. And I can confidently say that so far React is exactly what we expected it to be. Alien, confusing, but also very exciting! That is one of the things (and there are many!) that has been so great about NSS so far. As soon as we start to get comfortable with one method of doing something, it's time learn something else that changes our entire world. Such is the life of a programmer, so I've been told. <br/><br/> This weekend I'm going to spend some time reading up on the React documentation, and also try to get a head start on our current homework assignment."
    },
    "blog002": {
        "title": "Winter break",
        "Date": "January 3, 2019",
        "entry": "I wanted to use this time away from class to fully immerse myself in React, and consume as much learning materials as possible. I started with reading the <a href='https://reactjs.org/docs/hello-world.html' target='_blank'>offical documentation</a>, and then I read this insightful <a target='_blank' href='https://medium.freecodecamp.org/all-the-fundamental-react-js-concepts-jammed-into-this-single-medium-article-c83f9b53eac2'>piece</a> about the fundamentals of React by Samer Buna which helped to reinforce what we learned in class as well as what was in the official docs. After that I immediately started coding along with the <a target='_blank' href='https://reactforbeginners.com/'>React For Beginners</a> course by Wes Bos. Wes is just a fantastic personality. Easy to understand, easy to follow, and he makes it a fun experience. But the realest of 'Aha!' moments came during my time asking questions and getting advice from Adam Oswalt, aka: Common Table Adam. Adam is a veritable wizard. He is super helpful, and he possesses all the patience of a glacier. His knowledge is comprehensive. In particular, he helped me to really understand where to mess with state and why, and also gave me a high level introduction to the concept of object immutability. <br/><br/> So now after all that, I have successfully coded my first app in React, and I couldn't be happier! Also the timing is perfect with class starting back up in just a matter of days. And since Zoe has approved my front-end capstone proposal, I am chomping at the bit to get started! My project will be utilizing the Google Maps API. We'll see how that goes..."
    }
}